:PROPERTIES:
:ID:       66f1a5fc-cac4-45d3-a83d-09035a2a8385
:END:
#+title: js-oop-obj
#+filetags: :js:
#+date: [2024-07-11 四]
#+last_modified: [2024-07-11 四 22:14]


OBJ in js is a mp of props

#+BEGIN_SRC js :noweb yes :results output
let obj = new Object()

obj.name = "Lisi"
obj.sayHello = function() {
  console.log(this.name, "Hello!")
}

obj.sayHello()
#+END_SRC

#+RESULTS:
: Lisi Hello!


this.name was translated to obj.name

#+BEGIN_SRC js :noweb yes :results output
let obj = {
  name: "Lisi",
  sayHello : function(){
    console.log("Hello")
  }
}

obj.sayHello()
#+END_SRC

#+RESULTS:
: Hello


#+BEGIN_SRC js :noweb yes :results output
function Person(){
  return this
}

let p2 = Person()
console.log(p2 === global)
#+END_SRC

#+RESULTS:
: true

